Public Attributes | List of all members
API_GhostStoryType Struct Reference
View Handling
Ghost Story settings. More...
#include <APIdefs_Environment.h>
 Public Attributes
bool  | on
Ghost story is visible or hidden.
bool  | showOne
Ghost story is specified in the storyInd field (show this story)
bool  | showAbove
Show on the story above the current as ghost story.
bool  | showBelow
Show on the story below the current as ghost story.
short  | storyInd
The index of the story displayed as ghost story (if showOne is true)
API_RGBColor  | ghostColor
Ghost story color.
API_ElemFilter  | filter
Element type filter to show/hide elements on the ghost story.
Detailed Description
Ghost Story settings.
See also
ACAPI_View_GetGhostStorySettings
Remarks
This structure is a member of API_StoryInfo.
Member Data Documentation
◆ filter
 API_GhostStoryType::filter
Element type filter to show/hide elements on the ghost story.
◆ ghostColor
 API_GhostStoryType::ghostColor
Ghost story color.
◆ on
 API_GhostStoryType::on
Ghost story is visible or hidden.
◆ showAbove
 API_GhostStoryType::showAbove
Show on the story above the current as ghost story.
◆ showBelow
 API_GhostStoryType::showBelow
Show on the story below the current as ghost story.
◆ showOne
 API_GhostStoryType::showOne
Ghost story is specified in the storyInd field (show this story)
◆ storyInd
 API_GhostStoryType::storyInd
The index of the story displayed as ghost story (if showOne is true)